[MeleeExtraAttachmentSlotBreakthrough X2TechTemplate]
DisplayName="Modular Melee Weapons"
Summary=" ** Melee Combat Platform**\nPrevious research into modular weapons allowed us to transform our rudimentary blades into a highly portable and versatile combat platform. With further research, we can increase the capacity of our Melee weapons to house an additional array of miniaturized devices ranging from A.I. assistive technology to Psionic network interference modules that benefit the entire squad."